10/data/attachments/1162b39ab9e6937e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d1baff5a-977a-4f1a-9739-c1ae4e266936</nif:username>
            <nif:friendToBeAdded>David_option_Actions_53661_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>